app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
    def index
        @blog_posts = BlogPost.all

INSERT INTO "blog_posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello World 3"], ["body", "This is the first new creating blog"], ["created_at", "2023-05-11 16:35:43.749941"], ["updated_at", "2023-05-11 16:35:43.749941"]]
---
    def create
        @blog_post = BlogPost.new(blog_post_params)
        if @blog_post.save

UPDATE "blog_posts" SET "body" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["body", "new blog / try refacto"], ["updated_at", "2023-05-12 12:59:09.080258"], ["id", 6]]
---
    def update
        if @blog_post.update(blog_post_params)

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 4]]
---
    def destroy
        @blog_post.destroy

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_blog_post
        @blog_post = BlogPost.find(params[:id])